# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# CLI
brew 'bat'
brew 'gh'
brew 'git'
brew 'gitui'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'starship'

# Applications
cask 'android-studio'
cask 'asana'
cask 'bitwarden'
cask 'docker'
cask 'hiddenbar'
cask 'iina'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'firefox'
cask 'notion'
cask 'onyx'
cask 'raycast'
cask 'rectangle'
cask 'rekordbox'
cask 'sf-symbols'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'transmission'
cask 'vscodium'
cask 'wwdc'
cask 'xcodes'
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-lato'
cask 'font-open-sans'

# Mac App Store
mas 'A Companion for SwiftUI', id: 1485436674
mas 'Developer', id: 640199958
mas 'Logic Pro', id: 634148309
mas 'Spark', id: 1176895641
mas 'TestFlight', id: 899247664
mas 'Xcode', id: 497799835